[
  {
    "plant": "Rice",
    "diagnose": [
      {
        "name": "BrownSpot",
        "class": "Fungus",
        "description": "Brown Spot of rice is caused by the fungus Bipolaris oryzae. It manifests as small, circular, dark brown lesions on leaves leading to reduced photosynthesis and poor grain quality."
      },
      {
        "name": "Hispa",
        "class": "Insect",
        "description": "Rice Hispa caused by the insect Dicladi spa armigera results in feeding scars on leaves. The larvae feed on leaf tissues causing 'skeletonized' leaves and reduces photosynthetic capacity."
      },
      {
        "name": "LeafBlast",
        "class": "Fungus",
        "description": "Leaf Blast caused by the fungus Magnaporthe oryzae appears as diamond-shaped lesions with gray centers and dark borders on leaves. It can severely affect leaf function and yield."
      },
      {
        "name": "Healthy",
        "class": "",
        "description": "The respective plant is healthy."
      }
    ]
  },
  {
    "plant": "Maize",
    "diagnose": [
      {
        "name": "Rust",
        "class": "Fungus",
        "description": "Rust in corn is caused by the fungus Puccinia sorghi. It appears as small, reddish-brown pustules on leaves and stalks which can coalesce and cause significant leaf damage reducing photosynthetic capacity and yield."
      },
      {
        "name": "Gray Leaf Spot",
        "class": "Fungus",
        "description": "Gray Leaf Spot is caused by the fungus Cercospora zeae-maydis. It produces rectangular, grayish lesions on leaves which can merge to form large necrotic areas reducing the photosynthetic area and affecting yield."
      },
      {
        "name": "Blight",
        "class": "Fungus",
        "description": "Blight in corn often referred to as Northern Corn Leaf Blight which is caused by the fungus Exserohilum turcicum. It manifests as long, elliptical grayish-green lesions on the leaves which can merge to cause extensive leaf damage."
      },
      {
        "name": "Healthy",
        "class": "",
        "description": "The respective plant is healthy."
      }
    ]
  },
  {
    "plant": "Wheat",
    "diagnose": [
      {
        "name": "Brown Rust",
        "class": "Fungus",
        "description": "Brown Rust also known as leaf rust is caused by the fungus Puccinia triticina. It appears as small, reddish-brown pustules primarily on the upper surfaces of leaves. Severe infections can lead to significant yield loss."
      },
      {
        "name": "Yellow Rust",
        "class": "Fungus",
        "description": "Yellow Rust also known as stripe rust is caused by the fungus Puccinia striiformis. It produces yellowish, linear stripes of pustules on leaves and can spread rapidly under cool, wet conditions. This disease can severely reduce photosynthetic area and yield."
      },
      {
        "name": "Healthy",
        "class": "",
        "description": "The respective plant is healthy."
      }
    ]
  },
  {
    "plant": "Cotton",
    "diagnose": [
      {
        "name": "Bacterial Blight",
        "class": "Bacteria",
        "description": "Bacterial Blight in cotton is caused by the bacterium Xanthomonas citri subsp. malvacearum. It appears as water-soaked lesions on leaves, stems, and bolls which eventually turn black and may drop off. Severe infections can lead to defoliation and yield loss."
      },
      {
        "name": "Curl Virus",
        "class": "Virus",
        "description": "Curl Virus specifically Cotton Leaf Curl Virus (CLCuV) causes upward or downward curling of leaves, thickening of veins, and enations (small, leaf-like outgrowths) on the underside of leaves. This virus can significantly impact plant growth and yield."
      },
      {
        "name": "Fusarium Wilt",
        "class": "Fungus",
        "description": "Fusarium Wilt is caused by the soil-borne fungus Fusarium oxysporum f. sp. vasinfectum. It results in yellowing, wilting, and eventually death of leaves and stems starting from the lower parts of the plant. This disease can cause significant yield losses."
      },
      {
        "name": "Healthy",
        "class": "",
        "description": "The respective plant is healthy."
      }
    ]
  },
  {
    "plant": "Sugarcane",
    "diagnose": [
      {
        "name": "Bacterial Blight",
        "class": "Bacteria",
        "description": "Bacterial Blight in sugarcane is caused by the bacterium Xanthomonas albilineans. It appears as white to yellowish streaks on leaves with a water-soaked appearance that later turn brown. In severe cases, it can lead to leaf necrosis and significant yield loss."
      },
      {
        "name": "Red Rot",
        "class": "Fungus",
        "description": "Red Rot is caused by the fungus Colletotrichum falcatum. It manifests as reddish discoloration and rotting of the stalks, often accompanied by a sour smell. The affected stalks show a characteristic red color with white patches when split open. This disease can cause substantial yield loss."
      },
      {
        "name": "Healthy",
        "class": "",
        "description": "The respective plant is healthy."
      }
    ]
  },
  {
   "plant": "Tomato",
   "diagnose":  [
      {
        "name": "Bacterial Spot",
        "class": "Bacteria",
        "description": "Bacterial Spot in tomatoes is caused by several species of the bacterium Xanthomonas. It appears as small, water-soaked spots on leaves, stems, and fruits which eventually turn brown and become necrotic. Severe infections can lead to defoliation and reduced yield."
      },
      {
        "name": "Blight",
        "class": "Fungus",
        "description": "Blight in tomatoes including Early Blight is caused by Alternaria solani and Late Blight is caused by Phytophthora infestans which manifests as dark spots on leaves, stems, and fruits. These spots often have concentric rings and can cause extensive damage to the plant."
      },
      {
        "name": "Leaf Mold",
        "class": "Fungus",
        "description": "Leaf Mold in tomatoes is caused by the fungus Passalora fulva. It appears as yellow spots on the upper side of leaves with a corresponding olive-green to grayish mold growth on the underside. Severe infections can lead to leaf drop and reduced yield."
      },
      {
        "name": "Mosaic Virus",
        "class": "Virus",
        "description": "Mosaic Virus in tomatoes is caused by several viruses including Tomato Mosaic Virus (ToMV). It results in mottled, light and dark green patterns on the leaves along with stunted growth and reduced yield."
      },
      {
        "name": "Yellow Leaf Curl Virus",
        "class": "Virus",
        "description": "Yellow Leaf Curl Virus in tomatoes is caused by Tomato yellow leaf curl virus (TYLCV). It causes upward curling of leaves, yellowing, and stunted growth. This virus can significantly impact plant growth and fruit production."
      },
      {
        "name": "Healthy",
        "class": "",
        "description": "The respective plant is healthy."
      }
    ]
  },
  {
    "plant": "Plant Health",
    "diagnose": [
      {
        "name": "Powdery Mildew",
        "class": "Fungus",
        "description": "Powdery Mildew is a fungal disease that affects a wide range of plants. It is characterized by white, powdery spots on the leaves and stems. The fungus can lead to stunted growth and reduced yield."
      },
      {
        "name": "Rust",
        "class": "Fungus",
        "description": "Rust is a fungal disease that causes orange, yellow, or brown pustules on leaves and stems. It can weaken the plant by reducing photosynthetic ability and can spread rapidly under favorable conditions."
      },
      {
        "name": "Healthy",
        "class": "",
        "description": "A healthy plant shows no signs of disease which has vigorous growth, green leaves and is free from spots, mold or wilting. Healthy plants are productive and have strong resistance to pests and diseases."
      }
    ]
  }
]
